#Область ОбработчикиСобытийФломы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЭтотОбъект.Параметры, "ВыборКорпуса", Ложь) = Истина Тогда        
        ЭтотОбъект.Список.Параметры.УстановитьЗначениеПараметра("ВидСтруктурыОбозначение", "Корпус");
    Иначе
        ЭтотОбъект.Список.Параметры.УстановитьЗначениеПараметра("ВидСтруктурыОбозначение", "Аудитория");
    КонецЕсли;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФломы
