// Регистр сведений ТГИК_ИдентификаторыДляСайтаРасписания, модуль набора записей.
//
// Непериодический, независимый.
//  Измерение Объект - ОпределяемыйТип.ТГИК_ОбъектСайтаРасписания, ведущее.
//  Ресурс Идентификатор - Строка(50), индексировать.

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Для Каждого Запись Из ЭтотОбъект Цикл
		Запись.Идентификатор = НРег(СокрЛП(Запись.Идентификатор));
		Ошибка = ГП_СайтРасписанияСлужебный.ОшибкаИдентификатора(Запись.Объект, Запись.Идентификатор);
		Если ЗначениеЗаполнено(Ошибка) Тогда
			ОбщегоНазначения.СообщитьПользователю(Ошибка, , , , Отказ);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
