
&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
    ЭтотОбъект.Запись.Идентификатор = ПолучитьИдентификаторГруппыОбъекта(ЭтотОбъект.Запись.Объект);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИдентификаторГруппыОбъекта(Знач ГруппаСсылка)
    ТекНаименованиеГруппы = "";
    Если НЕ ГруппаСсылка.Пустая() Тогда
        ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ГруппаСсылка, "Наименование", Истина);
    КонецЕсли;
    
    РезФункции = НРег(СтроковыеФункцииКлиентСервер.СтрокаЛатиницей(ТекНаименованиеГруппы));
    Возврат РезФункции;
КонецФункции
