&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если ЭтотОбъект.Запись.ИсходныйКлючЗаписи.Пустой() Тогда
        ЭтотОбъект.Запись.Идентификатор = ПолучитьИдентификаторГруппыОбъекта(ЭтотОбъект.Запись.Объект);
        ЭтотОбъект.Модифицированность = Истина;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
    ЭтотОбъект.Запись.Идентификатор = ПолучитьИдентификаторГруппыОбъекта(ЭтотОбъект.Запись.Объект);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИдентификаторГруппыОбъекта(Знач ГруппаСсылка)
    ТекНаименованиеГруппы = "";
    Если НЕ ГруппаСсылка.Пустая() Тогда
        ТекНаименованиеГруппы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ГруппаСсылка, "Наименование", Истина);
    КонецЕсли;
    
    ТекНаименованиеГруппы = СокрЛП(ТекНаименованиеГруппы);
    ТекНаименованиеГруппы = СтрЗаменитьПоРегулярномуВыражению(ТекНаименованиеГруппы, "\s+", "_", Ложь, Ложь);
    РезФункции = НРег(СтроковыеФункцииКлиентСервер.СтрокаЛатиницей(ТекНаименованиеГруппы));
    
    Возврат РезФункции;
КонецФункции

