#Область ПрограммныйИнтерфейс

Функция СоответствияНомеровДнейНедели() Экспорт
    РезФункции = Новый Соответствие;
    
    ПредставленияДнейНедели = ПредставленияДнейНедели();
    
    ТекНомерДня = 0;
    Для Каждого ТекПредставление Из ПредставленияДнейНедели Цикл
        ТекНомерДня = ТекНомерДня + 1;
    	РезФункции.Вставить(ТекНомерДня, ТекПредставление);
    КонецЦикла;
    
    Возврат РезФункции;
КонецФункции

Функция ПредставленияДнейНедели() Экспорт
	РезФункции = СтрРазделить("понедельник, вторник, среда, четверг, пятница, суббота, воскресенье", ", ", Ложь);
    Возврат РезФункции;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
