#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

Функция ПолучитьДанныеПроведения(Знач Объект) Экспорт
    РезФункции = Новый Структура("ГП_РасписаниеЗанятийУпрощенный",
        Новый Структура("Организация, Факультет, ФормаОбучения, Курс, Группа, Корректировка, ДанныеРасписания"));
    
    ЗаполнитьЗначенияСвойств(РезФункции.ГП_РасписаниеЗанятийУпрощенный, Объект);
    РезФункции.ГП_РасписаниеЗанятийУпрощенный.Корректировка = Ложь;
    ЩаблонРасписания = Объект.ТаблицаРасписанияДетализация.Выгрузить();
    РезФункции.ГП_РасписаниеЗанятийУпрощенный.ДанныеРасписания = СформироватьГрафикРассписанияЗанятийПоШаблону(
        Объект.ДатаНачала, Объект.ДатаОкончания, ЩаблонРасписания);
        
    Возврат РезФункции;
КонецФункции

Функция СформироватьГрафикРассписанияЗанятийПоШаблону(Знач ДатаНачала, Знач ДатаОкончания, Знач ШаблонРасписания) Экспорт
    ИтоговоеРасписание = ШаблонРасписания.СкопироватьКолонки();
    Если ИтоговоеРасписание.Колонки.Найти("ДатаЗанятий") = Неопределено Тогда
    	ИтоговоеРасписание.Колонки.Добавить("ДатаЗанятий", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
    КонецЕсли;
    
    Если ШаблонРасписания.Количество() = 0 Тогда
        Возврат ИтоговоеРасписание;
    КонецЕсли;
    
    ТекДата = НачалоДня(ДатаНачала);
    КэшСтрокШаблона = Новый Соответствие;
    Пока ТекДата <= ДатаОкончания Цикл
        ТекДеньНедели = ДеньНедели(ТекДата);
        
        СтрокиШаблона = КэшСтрокШаблона.Получить(ТекДеньНедели);
        Если СтрокиШаблона = Неопределено Тогда
            СтрокиШаблона = ШаблонРасписания.НайтиСтроки(Новый Структура("НомерДня", ТекДеньНедели));
            КэшСтрокШаблона.Вставить(ТекДеньНедели, СтрокиШаблона);
        КонецЕсли;
        
        Если СтрокиШаблона = Неопределено ИЛИ СтрокиШаблона = Ложь Тогда
            ТекДата = ТекДата + 86400;
            Продолжить;
        КонецЕсли;
        
        Для Каждого ТекСтр Из СтрокиШаблона Цикл
            НовСтрока = ИтоговоеРасписание.Добавить();
            ЗаполнитьЗначенияСвойств(НовСтрока, ТекСтр);
            НовСтрока.ДатаЗанятий = ТекДата;
        КонецЦикла;
        
        ТекДата = ТекДата + 86400;
    КонецЦикла;
    
    Возврат ИтоговоеРасписание;
КонецФункции

#КонецЕсли
