
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    ТекДанныеПроведения = Документы.ГП_РасписаниеЗанятийУпрощенный.ПолучитьДанныеПроведения(ЭтотОбъект);
    ДанныеРасписаний = ТекДанныеПроведения.ГП_РасписаниеЗанятийУпрощенный;
    
    ЭтотОбъект.Движения.ГП_РасписаниеЗанятийУпрощенный.Записывать = Истина;
    Для Каждого ТекСтр Из ДанныеРасписаний.ДанныеРасписания Цикл
        НовЗапись = ЭтотОбъект.Движения.ГП_РасписаниеЗанятийУпрощенный.Добавить();
        ЗаполнитьЗначенияСвойств(НовЗапись, ДанныеРасписаний);
        ЗаполнитьЗначенияСвойств(НовЗапись, ТекСтр);
        НовЗапись.Период = НачалоДня(ЭтотОбъект.Дата);
    КонецЦикла;
    
	Если Не Отказ Тогда
		ЭтотОбъект.Движения.Записать();
	КонецЕсли;
КонецПроцедуры
