#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
    Если ЭтотОбъект.Объект.Ссылка.Пустая() Тогда
        ЭтотОбъект.Объект.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
        Если ЭтотОбъект.Объект.ТаблицаРасписания.Количество() = 0 Тогда
        	ЗаполнитьТаблицуРасписанияЗначениямиПоУмолчаниюНаСервере();
        КонецЕсли;
    КонецЕсли;
    
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
    
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    ТаблицаРасписанияПриАктивизацииСтроки(Неопределено);
    
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТаблицаРасписанияПриАктивизацииСтроки(Элемент)
    ТекИдентификаторОтбора = Неопределено;
    
    Если ЭтотОбъект.Элементы.ТаблицаРасписания.ТекущиеДанные <> Неопределено Тогда
    	 ТекИдентификаторОтбора = ЭтотОбъект.Элементы.ТаблицаРасписания.ТекущиеДанные.НомерДня;
    КонецЕсли;
    
    УстановитьОтборТаблицыРаспесанияПоИдентификаторуДня(ТекИдентификаторОтбора);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРасписанияДетализацияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
    Если Копирование <> Истина Тогда
        Если ЭтотОбъект.Элементы.ТаблицаРасписания.ТекущиеДанные = Неопределено Тогда
            Отказ = Истина;
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРасписанияДетализацияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
    Если НоваяСтрока = Истина И Элемент.ТекущиеДанные <> Неопределено
        И ЭтотОбъект.Элементы.ТаблицаРасписания.ТекущиеДанные <> Неопределено Тогда
        
        Если Копирование <> Истина Тогда
            Элемент.ТекущиеДанные.НомерДня = ЭтотОбъект.Элементы.ТаблицаРасписания.ТекущиеДанные.НомерДня;	
        КонецЕсли;
        
        Элемент.ТекущиеДанные.НомерПары = ЭтотОбъект.Объект.ТаблицаРасписанияДетализация.НайтиСтроки(
            Новый Структура("НомерДня", Элемент.ТекущиеДанные.НомерДня)).Количество();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРасписанияПоДнямАудиторияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
    СтандартнаяОбработка = Ложь;
    
    ОткрытьФорму("Справочник.СтруктураУниверситета.Форма.ГП_ФормаВыбораАудитории",
        Новый Структура("ВыборКорпуса", Ложь), ЭтотОбъект, , , ,
        Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораАудитории", ЭтотОбъект, Новый Структура("ЭтоАудитория, Элемент", Истина, Элемент)));
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРасписанияДетализацияКорпусНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
    СтандартнаяОбработка = Ложь;
    
    ОткрытьФорму("Справочник.СтруктураУниверситета.Форма.ГП_ФормаВыбораАудитории",
        Новый Структура("ВыборКорпуса", Истина), ЭтотОбъект, , , ,
        Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораАудитории", ЭтотОбъект, Новый Структура("ЭтоКорпус, Элемент", Истина, Элемент)));
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыВыбораАудитории(Знач Значение, Знач ДопПараметры) Экспорт
    Если ТипЗнч(Значение) <> Тип("СправочникСсылка.СтруктураУниверситета") ИЛИ ЭтотОбъект.Элементы.ТаблицаРасписанияДетализация.ТекущиеДанные = Неопределено Тогда
    	Возврат;
    КонецЕсли;
    
    Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДопПараметры, "ЭтоКорпус", Ложь) = Истина Тогда
    	ЭтотОбъект.Элементы.ТаблицаРасписанияДетализация.ТекущиеДанные.Корпус = Значение;
    Иначе
        ЭтотОбъект.Элементы.ТаблицаРасписанияДетализация.ТекущиеДанные.Аудитория = Значение;
    КонецЕсли;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовФормы

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаполнитьТаблицуРасписанияЗначениямиПоУмолчаниюНаСервере()
    ЭтотОбъект.Объект.ТаблицаРасписанияДетализация.Очистить();
    ЭтотОбъект.Объект.ТаблицаРасписания.Очистить();
    
    СоотвНомеровДнейНедели = ГП_РаботаСРасписаниемЗанятийКлиентСервер.СоответствияНомеровДнейНедели();
    Для Каждого ТекКЗ Из СоотвНомеровДнейНедели Цикл
        НовСтрока = ЭтотОбъект.Объект.ТаблицаРасписания.Добавить();
        НовСтрока.Используется = Истина;
        НовСтрока.НомерДня = ТекКЗ.Ключ;
        НовСтрока.ПредставлениеДня = ТекКЗ.Значение;
    КонецЦикла;
    
    ЭтотОбъект.Объект.ТаблицаРасписания.Сортировать("НомерДня");
КонецФункции

&НаКлиенте
Функция УстановитьОтборТаблицыРаспесанияПоИдентификаторуДня(Знач ИдентификаторДня)
    ЭтотОбъект.Элементы.ТаблицаРасписанияДетализация.ОтборСтрок = Новый ФиксированнаяСтруктура("НомерДня", ИдентификаторДня);
КонецФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

// Обработчик команды формы, требующей контекстного вызова сервера.
//
// Параметры:
//  ПараметрыВыполнения - Структура - Содержит параметры выполнения команды.
//  ДополнительныеПараметры - Неопределено - Фиктивный параметр, требуемый для обработчиков оповещений.
//
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти // СлужебныеПроцедурыИФункции
