#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если ЭтотОбъект.Объект.Ссылка.Пустая() Тогда
        ЗаполнитьТаблицуРасписанияЗначениямиПоУмолчаниюНаСервере();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    ТаблицаРасписанияПриАктивизацииСтроки(Неопределено);
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТаблицаРасписанияПриАктивизацииСтроки(Элемент)
    ТекИдентификаторОтбора = Неопределено;
    
    Если ЭтотОбъект.Элементы.ТаблицаРасписания.ТекущиеДанные <> Неопределено Тогда
    	 ТекИдентификаторОтбора = ЭтотОбъект.Элементы.ТаблицаРасписания.ТекущиеДанные.НомерДня;
    КонецЕсли;
    
    УстановитьОтборТаблицыРаспесанияПоИдентификаторуДня(ТекИдентификаторОтбора);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРасписанияДетализацияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
    Если Копирование <> Истина Тогда
        Если ЭтотОбъект.Элементы.ТаблицаРасписания.ТекущиеДанные = Неопределено Тогда
            Отказ = Истина;
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРасписанияДетализацияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
    Если НоваяСтрока = Истина И Копирование <> Истина И Элемент.ТекущиеДанные <> Неопределено
        И ЭтотОбъект.Элементы.ТаблицаРасписания.ТекущиеДанные <> Неопределено Тогда
        
        Элемент.ТекущиеДанные.НомерДня = ЭтотОбъект.Элементы.ТаблицаРасписания.ТекущиеДанные.НомерДня;
    КонецЕсли;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовФормы

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаполнитьТаблицуРасписанияЗначениямиПоУмолчаниюНаСервере()
    ЭтотОбъект.Объект.ТаблицаРасписанияДетализация.Очистить();
    ЭтотОбъект.Объект.ТаблицаРасписания.Очистить();
    
    СоотвНомеровДнейНедели = ГП_РаботаСРасписаниемЗанятийКлиентСервер.СоответствияНомеровДнейНедели();
    Для Каждого ТекКЗ Из СоотвНомеровДнейНедели Цикл
        НовСтрока = ЭтотОбъект.Объект.ТаблицаРасписания.Добавить();
        НовСтрока.Используется = Истина;
        НовСтрока.НомерДня = ТекКЗ.Ключ;
        НовСтрока.ПредставлениеДня = ТекКЗ.Значение;
    КонецЦикла;
    
    ЭтотОбъект.Объект.ТаблицаРасписания.Сортировать("НомерДня");
КонецФункции

&НаКлиенте
Функция УстановитьОтборТаблицыРаспесанияПоИдентификаторуДня(Знач ИдентификаторДня)
    ЭтотОбъект.Элементы.ТаблицаРасписанияДетализация.ОтборСтрок = Новый ФиксированнаяСтруктура("НомерДня", ИдентификаторДня);
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
